[
{
  "ID": 1,
  "Product": "SonicWave Bluetooth Headphones - Noise Cancelling, Over-Ear, 30H Battery",
  "Description": "Noise-cancelling over-ear headphones with 30 hours battery life.",
  "LongDescription": "Experience superior sound quality with the SonicWave Bluetooth Headphones — designed for comfort, durability, and immersive audio performance. These over-ear headphones feature advanced noise-cancelling technology that blocks out ambient noise, allowing you to fully immerse yourself in your favorite music, podcasts, or calls. Whether you're commuting, working, or relaxing at home, enjoy crisp highs, rich mids, and powerful bass without distractions. With up to 30 hours of battery life on a single charge, the SonicWave headphones keep the music going all day and well into the night. The ergonomic design provides a snug yet comfortable fit with soft, cushioned ear pads that reduce fatigue during extended wear. Plus, the adjustable headband ensures a perfect fit for every head size. Seamlessly connect to your smartphone, tablet, or laptop via Bluetooth 5.0 for a stable, high-quality wireless experience with minimal latency. The built-in microphone and intuitive controls let you manage calls, play/pause music, and adjust volume without reaching for your device. Key Features: Advanced Active Noise Cancelling: Enjoy your audio in peace, blocking out city noise, office chatter, or travel sounds. Long-lasting Battery: Up to 30 hours of wireless playback with quick charge capabilities for uninterrupted listening. Comfort First: Soft memory foam ear cushions and adjustable headband for all-day wear. Bluetooth 5.0 Connectivity: Stable, fast pairing with all Bluetooth-enabled devices. Hands-Free Calling: Integrated mic with noise reduction for clear phone conversations. Sleek, Durable Design: Lightweight and foldable for easy portability and storage. Upgrade your audio experience today with the SonicWave Bluetooth Headphones — where style meets performance. Perfect for music lovers, remote workers, gamers, and travelers.",
  "Brand": "SonicWave",
  "Price": 99.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 2,
  "Product": "NovaTech Smartphone 128GB - 5G, AMOLED Display, High Performance",
  "Description": "5G-enabled smartphone with 128GB storage and AMOLED display.",
  "LongDescription": "Stay connected and productive with the NovaTech Smartphone 128GB, designed for speed, clarity, and reliability. Featuring ultra-fast 5G connectivity, this phone ensures smooth streaming, quick downloads, and lag-free gaming wherever you go. The vibrant AMOLED display delivers stunning colors and deep blacks for an immersive viewing experience, perfect for videos, games, and browsing. With 128GB of storage, you'll have ample space for apps, photos, and media, while the powerful processor handles multitasking and demanding apps effortlessly. Capture life’s moments with the high-resolution camera system and enjoy long battery life to keep you going throughout your busy day. The sleek, ergonomic design fits comfortably in your hand and complements your style. Perfect for professionals, students, and tech enthusiasts looking for premium features at a competitive price.",
  "Brand": "NovaTech",
  "Price": 599.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 3,
  "Product": "EchoBeat Bluetooth Speaker - Waterproof, 12H Playtime, Deep Bass",
  "Description": "Waterproof speaker with 12 hours playtime and deep bass.",
  "LongDescription": "Take your music anywhere with the EchoBeat Bluetooth Speaker — a compact, durable, and waterproof speaker designed for outdoor adventures and everyday use. Delivering powerful deep bass and clear sound, this speaker keeps your favorite tunes going for up to 12 hours on a single charge. Whether you’re poolside, hiking, or hosting a party, its rugged design and IPX7 waterproof rating ensure it can handle splashes, rain, or even brief submersion without missing a beat. Connect effortlessly with Bluetooth 5.0 for a stable wireless experience, and use the built-in microphone for hands-free calls. Lightweight and portable, the EchoBeat speaker is your perfect companion for music on the move.",
  "Brand": "EchoBeat",
  "Price": 49.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 4,
  "Product": "Adventura 4K Action Camera - Wi-Fi, Waterproof, Ultra HD",
  "Description": "Ultra HD waterproof action camera with Wi-Fi and accessories.",
  "LongDescription": "Capture every moment in stunning Ultra HD with the Adventura 4K Action Camera. Perfect for thrill-seekers and creators, this compact camera offers crystal-clear 4K video recording and high-resolution photos, all packed into a rugged, waterproof design that withstands the elements. Equipped with built-in Wi-Fi, you can easily connect to your smartphone for instant sharing and remote control. The Adventura camera comes with essential accessories including mounts and waterproof housing, making it ideal for sport, underwater adventures, travel, and more. Lightweight and easy to use, it lets you relive your adventures in vibrant detail.",
  "Brand": "Adventura",
  "Price": 129.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 5,
  "Product": "FitPulse Smartwatch - GPS, Heart Rate Monitor, Fitness Tracking",
  "Description": "Fitness tracker smartwatch with heart rate monitor and GPS.",
  "LongDescription": "Stay on top of your health and fitness goals with the FitPulse Smartwatch. Equipped with built-in GPS and an accurate heart rate monitor, this smartwatch tracks your workouts, steps, calories burned, and sleep patterns. Its sleek, lightweight design ensures comfortable all-day wear, while the intuitive touchscreen lets you easily navigate apps and notifications. Whether you're running, cycling, or just staying active throughout the day, the FitPulse Smartwatch provides real-time insights to help you optimize your performance and stay motivated. Compatible with both Android and iOS devices, it’s the perfect fitness companion for every lifestyle.",
  "Brand": "FitPulse",
  "Price": 79.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 6,
  "Product": "ZenithOne Laptop 15.6\" - 8GB RAM, 512GB SSD, Lightweight Design",
  "Description": "Lightweight laptop with 8GB RAM and 512GB SSD.",
  "LongDescription": "The ZenithOne Laptop combines power and portability in a sleek 15.6-inch design. Equipped with 8GB of RAM and a fast 512GB SSD, it handles everyday tasks, multitasking, and creative work with ease. The vibrant display delivers sharp visuals, while the lightweight chassis makes it perfect for on-the-go productivity. With a full-size keyboard and long-lasting battery, the ZenithOne is designed to keep up with your busy lifestyle, whether you’re working from home, studying, or streaming your favorite content.",
  "Brand": "ZenithOne",
  "Price": 799.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 7,
  "Product": "GlideTech Wireless Mouse - Ergonomic, Adjustable DPI, USB",
  "Description": "Ergonomic wireless mouse with adjustable DPI settings.",
  "LongDescription": "Enhance your productivity with the GlideTech Wireless Mouse, designed for comfort and precision. Its ergonomic shape reduces hand fatigue during extended use, while adjustable DPI settings allow you to customize cursor sensitivity for different tasks, from detailed graphic work to quick web browsing. Easy to connect via USB receiver, this mouse offers a stable wireless connection with low latency. Compact and lightweight, it’s an ideal accessory for both office and home setups.",
  "Brand": "GlideTech",
  "Price": 19.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 8,
  "Product": "KeyForge Mechanical Keyboard - RGB Backlit, Blue Switches",
  "Description": "RGB backlit mechanical keyboard with blue switches.",
  "LongDescription": "Take your typing and gaming experience to the next level with the KeyForge Mechanical Keyboard. Featuring tactile blue switches, this keyboard provides satisfying feedback with every keystroke, ideal for both gamers and typists. The customizable RGB backlighting lets you personalize your setup with vibrant colors and lighting effects. Built with durable materials and a sturdy frame, the KeyForge is designed to withstand intense use while delivering precision and comfort. USB connectivity ensures plug-and-play simplicity for desktop and laptop users alike.",
  "Brand": "KeyForge",
  "Price": 69.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 9,
  "Product": "DataCore External Hard Drive 1TB - USB 3.0, Portable",
  "Description": "Portable 1TB external hard drive USB 3.0.",
  "LongDescription": "The DataCore External Hard Drive is your ultimate portable storage solution, offering a massive 1TB of space to securely store your photos, videos, documents, and important files. Engineered with USB 3.0 technology, it delivers blazing-fast data transfer speeds up to 5 Gbps, significantly reducing wait times when backing up or accessing large files. Its compact and lightweight design makes it perfect for professionals, students, and anyone on the move who needs reliable storage. The rugged casing protects against accidental bumps and drops, while the plug-and-play functionality ensures compatibility with Windows, Mac, and Linux systems without the need for complicated installations. Whether you’re creating backups, sharing files, or expanding your device’s storage, DataCore offers performance and portability in one sleek package.",
  "Brand": "DataCore",
  "Price": 54.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 10,
  "Product": "ClearView 1080p Webcam - Full HD, Built-in Microphone",
  "Description": "Full HD webcam with built-in microphone for video calls.",
  "LongDescription": "Transform your video conferencing and live streaming experience with the ClearView 1080p Webcam. Designed for crystal-clear Full HD video at 30 frames per second, this webcam ensures you look sharp and professional on every call. The built-in noise-canceling microphone captures your voice with clarity, reducing background noise so your messages are heard loud and clear. Ideal for remote workers, educators, and content creators, ClearView is compatible with all major video calling platforms including Zoom, Skype, Microsoft Teams, and Google Meet. Its universal clip fits securely on laptops, monitors, or tripods, and its plug-and-play USB connection means setup is quick and hassle-free. Elevate your online presence with ClearView’s smooth video quality and reliable performance.",
  "Brand": "ClearView",
  "Price": 39.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 11,
  "Product": "LinkPro USB-C Hub - 7-in-1, HDMI, SD Reader, USB 3.0",
  "Description": "7-in-1 USB-C hub with HDMI, USB 3.0, and SD card reader.",
  "LongDescription": "Expand your device’s connectivity with the LinkPro 7-in-1 USB-C Hub, a versatile accessory that transforms a single USB-C port into a multi-functional workstation. Perfect for laptops, tablets, and smartphones, this compact hub includes an HDMI port supporting up to 4K resolution for seamless video output to external monitors or projectors. Multiple USB 3.0 ports allow high-speed connections to keyboards, mice, storage devices, and more. The built-in SD and microSD card readers provide quick access to photos and media from your camera or mobile device. Its lightweight aluminum alloy construction offers durability and efficient heat dissipation, making it ideal for professionals, students, and creatives who require a clutter-free, portable solution to connect all their essential peripherals. Plug-and-play compatibility with no drivers needed means you can get started immediately.",
  "Brand": "LinkPro",
  "Price": 34.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 12,
  "Product": "ZenAudio Earbuds - Noise Cancelling, True Wireless, Charging Case",
  "Description": "True wireless earbuds with ANC and wireless charging case.",
  "LongDescription": "Immerse yourself in crystal-clear sound and unparalleled freedom with the ZenAudio True Wireless Earbuds. Featuring cutting-edge Active Noise Cancellation (ANC) technology, these earbuds block out ambient noise so you can fully focus on your music, podcasts, or calls in any environment. Designed for comfort, their ergonomic shape fits securely in your ears for hours of fatigue-free listening. The included compact charging case supports wireless charging and provides multiple full charges on the go, ensuring your earbuds are ready whenever you are. With intuitive touch controls, manage your playlists, adjust volume, and answer calls effortlessly without reaching for your device. IPX5 water resistance protects against sweat and rain, making ZenAudio perfect for workouts, commuting, and everyday use. Enjoy up to 6 hours of continuous playback on a single charge, extending to 24 hours with the charging case. Elevate your audio experience with premium sound quality, seamless connectivity, and sleek design.",
  "Brand": "ZenAudio",
  "Price": 89.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 13,
  "Product": "PixelRush Gaming Monitor 27\" - 144Hz, 1ms, FreeSync",
  "Description": "27-inch 144Hz gaming monitor with 1ms response time and FreeSync.",
  "LongDescription": "Take your gaming setup to the next level with the PixelRush 27-inch Gaming Monitor, engineered for serious gamers seeking ultra-smooth, responsive gameplay. With a blazing-fast 144Hz refresh rate and an ultra-low 1ms response time, this monitor drastically reduces motion blur and ghosting, ensuring crisp visuals during fast-paced action. AMD FreeSync technology synchronizes the monitor’s refresh rate with your graphics card to eliminate screen tearing and stuttering for seamless visuals. The Full HD IPS display delivers vibrant colors and wide viewing angles, making it perfect for immersive gaming and multimedia. Its sleek, narrow bezel design maximizes screen real estate and enhances multi-monitor setups. Multiple connectivity options including HDMI and DisplayPort make it compatible with PCs and gaming consoles. Whether you’re a competitive esport player or a casual gamer, PixelRush delivers smooth, lag-free performance that helps you stay ahead of the competition.",
  "Brand": "PixelRush",
  "Price": 249.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 14,
  "Product": "SafeNest Smart Security Camera - Wi-Fi, Night Vision, Motion Alerts",
  "Description": "Indoor/outdoor Wi-Fi security camera with night vision and motion alerts.",
  "LongDescription": "Secure your home or business with the SafeNest Smart Security Camera, designed for 24/7 peace of mind both indoors and outdoors. Featuring high-definition video streaming over Wi-Fi, this camera provides crisp, clear images day or night with powerful infrared night vision. The intelligent motion detection system alerts you instantly via smartphone notifications when activity is detected, allowing you to monitor suspicious movement in real time. SafeNest also includes two-way audio so you can listen and communicate remotely through the camera’s built-in microphone and speaker. Its weather-resistant design withstands rain, snow, and dust, making it ideal for outdoor surveillance. Easy to install with flexible mounting options and compatible with popular smart home platforms like Alexa and Google Assistant, SafeNest brings convenience, control, and security right to your fingertips.",
  "Brand": "SafeNest",
  "Price": 59.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 15,
  "Product": "VoltEdge Wireless Charging Pad - Fast Qi Charging, Slim Design",
  "Description": "Fast wireless charging pad compatible with Qi-enabled devices.",
  "LongDescription": "Experience the convenience of cable-free power with the VoltEdge Wireless Charging Pad. This fast-charging pad is compatible with all Qi-enabled smartphones, earbuds, and accessories, delivering safe and efficient power transfer without the clutter of wires. Its sleek, ultra-slim design fits seamlessly on any desk, nightstand, or office space, while the non-slip surface keeps your device securely in place during charging. The VoltEdge includes built-in safeguards to protect against overheating, overcharging, and short-circuiting, ensuring safety for both your device and home. Ideal for daily use at home or in the office, it supports fast charging protocols to power up your device quickly and reliably. Simplify your charging routine with VoltEdge’s blend of style, speed, and safety.",
  "Brand": "VoltEdge",
  "Price": 24.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 16,
  "Product": "TrackMate Bluetooth Tracker - Key Finder, App Control",
  "Description": "Compact Bluetooth tracker for keys, bags, or pets with app integration.",
  "LongDescription": "Never lose your valuables again with the TrackMate Bluetooth Tracker, a compact and reliable device designed to keep track of your keys, bags, pets, and more. Using the intuitive companion app, you can quickly locate your items with precise proximity alerts and GPS-like last-seen location tracking on a map. The tracker emits a loud alert sound, helping you find misplaced items even when they’re out of sight. Lightweight and durable, TrackMate attaches easily to almost anything without adding bulk. Compatible with both Android and iOS devices, it integrates seamlessly with your smartphone, offering customizable alerts and user-friendly interface. Whether you’re prone to losing your essentials or just want added peace of mind, TrackMate makes it easy to stay organized and connected.",
  "Brand": "TrackMate",
  "Price": 14.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 17,
  "Product": "StreamCast USB Microphone - Studio Quality, Streaming & Podcasting",
  "Description": "USB condenser microphone for streaming, podcasting, and voice-over work.",
  "LongDescription": "Achieve professional-grade audio quality with the StreamCast USB Microphone, crafted for streamers, podcasters, content creators, and voice-over artists. Its condenser capsule delivers rich, clear sound with minimal background noise, capturing every nuance of your voice. Plug-and-play USB connectivity ensures easy setup on both Windows and Mac platforms without the need for additional drivers. The mic features a cardioid pickup pattern to isolate your voice from ambient sounds, making it ideal for noisy environments. Its durable build and sleek design fit perfectly in any home studio or desktop setup. With StreamCast, you get a reliable and affordable solution to enhance your audio recordings and broadcasts.",
  "Brand": "StreamCast",
  "Price": 79.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 18,
  "Product": "FlashXpress Portable SSD 500GB - High-Speed, USB-C",
  "Description": "High-speed portable SSD with 500GB capacity and USB-C connection.",
  "LongDescription": "Take your data with you wherever you go with the FlashXpress Portable SSD. Boasting 500GB of high-speed storage, this ultra-compact device uses the latest USB-C interface to deliver lightning-fast read and write speeds, dramatically reducing file transfer times compared to traditional hard drives. Its shock-resistant design guards your files against drops and bumps, making it ideal for photographers, videographers, and professionals on the move. Compatible with Windows, Mac, and Linux operating systems, FlashXpress ensures broad usability. Whether you’re backing up important documents or editing large media files, this SSD provides the speed and reliability you need in a portable package.",
  "Brand": "FlashXpress",
  "Price": 99.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 19,
  "Product": "GlowSmart Smart Light Bulbs (4-Pack) - Wi-Fi, Color Changing, App Control",
  "Description": "Wi-Fi enabled color-changing LED bulbs with app and voice control.",
  "LongDescription": "Brighten your living space with the GlowSmart Smart Light Bulbs, a versatile set of four Wi-Fi enabled LED bulbs that allow full color customization and dimming directly from your smartphone or tablet. Compatible with major voice assistants like Alexa, Google Assistant, and Siri, you can control your lighting hands-free, set schedules, or create mood lighting for any occasion. Energy-efficient and long-lasting, these bulbs reduce power consumption without compromising brightness. Whether you want vibrant colors for a party or warm white light for relaxing evenings, GlowSmart lets you personalize your home lighting with ease and style.",
  "Brand": "GlowSmart",
  "Price": 39.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 20,
  "Product": "DoorGuardian Video Doorbell - HD Video, Two-Way Audio, Motion Detection",
  "Description": "Wireless video doorbell with HD video, two-way audio, and motion detection.",
  "LongDescription": "Secure your home entrance with the DoorGuardian Video Doorbell, combining advanced security features with smart home convenience. Capture crisp HD video footage of visitors and deliveries, even in low light, thanks to its high-quality camera and infrared night vision. Communicate directly through two-way audio, enabling you to speak with guests from anywhere using your smartphone. The intelligent motion detection system sends real-time alerts when movement is detected, allowing you to monitor activity and respond immediately. Easy to install wirelessly and compatible with popular smart home ecosystems, DoorGuardian provides peace of mind and enhanced control over your home’s front door.",
  "Brand": "DoorGuardian",
  "Price": 89.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 21,
  "Product": "BladeMaster Chef's Knife - 8\" Stainless Steel, Ergonomic Handle",
  "Description": "8-inch high-carbon stainless steel chef's knife with ergonomic handle.",
  "LongDescription": "The BladeMaster Chef's Knife is crafted from premium high-carbon stainless steel, delivering exceptional sharpness and durability for all your kitchen tasks. Its 8-inch blade provides excellent balance and control, allowing you to chop, slice, and dice with precision and ease. The ergonomic handle is designed to fit comfortably in your hand, reducing fatigue during extended use. Ideal for both professional chefs and home cooks, this versatile knife handles everything from vegetables to meats with flawless performance. Its rust-resistant construction and easy-to-clean design ensure long-lasting use and hygiene in your kitchen.",
  "Brand": "BladeMaster",
  "Price": 29.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 22,
  "Product": "CookEase Frying Pan 12\" - Non-Stick, Aluminum, Heat-Resistant Handle",
  "Description": "12-inch aluminum frying pan with non-stick coating and heat-resistant handle.",
  "LongDescription": "Cook your favorite meals effortlessly with the CookEase 12-inch Frying Pan. Featuring a durable aluminum body for rapid, even heat distribution, this pan prevents hot spots and ensures perfectly cooked food every time. The premium non-stick coating allows you to cook with less oil and guarantees easy food release and hassle-free cleaning. Its heat-resistant, ergonomic handle stays cool to the touch for safe handling during cooking. Suitable for all stovetops except induction, the CookEase frying pan is a must-have for sautéing, frying, and browning dishes with confidence and convenience.",
  "Brand": "CookEase",
  "Price": 34.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 23,
  "Product": "MixPro Blender - 700W, 1.5L Glass Jar, 5-Speed Settings",
  "Description": "700W countertop blender with 1.5L glass jar and 5-speed settings.",
  "LongDescription": "Blend, crush, and puree your favorite ingredients with the powerful MixPro Blender. Equipped with a robust 700W motor, it effortlessly handles tough ingredients like ice, frozen fruits, and nuts. The large 1.5-liter glass jar is both durable and dishwasher safe, making cleanup a breeze. Choose from 5 adjustable speed settings to customize your blending experience for smoothies, soups, sauces, and more. The blender’s safety lock and non-slip base provide added security during operation. With its sleek design and easy-to-use controls, MixPro is an essential kitchen companion for health enthusiasts and busy families alike.",
  "Brand": "MixPro",
  "Price": 59.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 24,
  "Product": "BoilMax Electric Kettle 1.7L - Stainless Steel, Auto Shut-Off",
  "Description": "1.7-liter electric kettle with auto shut-off and stainless steel body.",
  "LongDescription": "The BoilMax Electric Kettle combines speed, safety, and style to make boiling water easier than ever. Its 1.7-liter capacity is perfect for brewing multiple cups of tea or coffee at once. The stainless steel construction offers durability and a modern aesthetic, while the concealed heating element ensures fast boiling and easy cleaning. Safety features include an automatic shut-off when water reaches boiling point and boil-dry protection to prevent damage when empty. The cordless 360-degree swivel base adds convenience and flexibility, making it ideal for any kitchen or office space.",
  "Brand": "BoilMax",
  "Price": 39.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 25,
  "Product": "QuickToast Toaster - 2-Slice, Browning Control, Crumb Tray",
  "Description": "Compact 2-slice toaster with browning control and crumb tray.",
  "LongDescription": "Start your day with perfectly toasted bread using the QuickToast 2-Slice Toaster. Its adjustable browning control lets you customize the toast to your preferred level of crispiness, whether light and golden or dark and crunchy. The compact design fits comfortably on any countertop without taking up too much space. The removable crumb tray collects crumbs for easy cleaning, helping keep your kitchen tidy. With quick and even toasting performance, QuickToast is the reliable choice for busy mornings or quick snacks.",
  "Brand": "QuickToast",
  "Price": 24.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 26,
  "Product": "CrispMate Air Fryer 4Qt - Digital Touchscreen, 8 Preset Modes",
  "Description": "4-quart digital air fryer with touchscreen and 8 preset functions.",
  "LongDescription": "Enjoy healthier, crispy meals with the CrispMate 4-Quart Air Fryer. Using rapid air circulation technology, it cooks food with little to no oil, reducing fat without sacrificing flavor or texture. The user-friendly digital touchscreen lets you select from 8 preset cooking modes including fries, chicken, seafood, and baked goods, simplifying meal preparation. Its spacious 4-quart capacity is perfect for families or small gatherings. Easy to clean with a non-stick basket and dishwasher-safe components, CrispMate combines convenience, versatility, and health-conscious cooking in one stylish appliance.",
  "Brand": "CrispMate",
  "Price": 89.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 27,
  "Product": "PrepSmart Food Processor - 12-Cup, Slicing & Shredding Attachments",
  "Description": "12-cup food processor with slicing, chopping, and shredding attachments.",
  "LongDescription": "Simplify your food prep with the PrepSmart 12-Cup Food Processor, a versatile kitchen powerhouse designed to save you time and effort. Its large-capacity bowl handles everything from chopping vegetables to shredding cheese, while included slicing and shredding discs provide professional results with minimal effort. The powerful motor delivers consistent performance for purees, doughs, and more. Safety locking mechanisms and easy-to-use controls ensure reliable operation. Whether preparing salads, sauces, or baking ingredients, PrepSmart streamlines your kitchen tasks for fast, efficient cooking.",
  "Brand": "PrepSmart",
  "Price": 99.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 28,
  "Product": "TenderTime Slow Cooker 6Qt - Programmable, Stoneware Insert",
  "Description": "6-quart programmable slow cooker with removable stoneware insert.",
  "LongDescription": "Make mealtime effortless with the TenderTime 6-Quart Slow Cooker, perfect for preparing flavorful dishes with minimal hands-on time. The programmable timer lets you set cooking durations and automatically switches to keep-warm mode when finished, ensuring your meals are ready exactly when you want them. The durable stoneware insert is removable and dishwasher safe for easy cleanup. Its large capacity accommodates family-sized meals or batch cooking. Whether slow-cooking stews, soups, or roasts, TenderTime delivers tender, delicious results with simple operation and reliable performance.",
  "Brand": "TenderTime",
  "Price": 49.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 29,
  "Product": "BrewPro Coffee Maker - 12-Cup, Programmable Timer, Glass Carafe",
  "Description": "12-cup drip coffee maker with glass carafe and programmable timer.",
  "LongDescription": "Wake up to fresh coffee every day with the BrewPro 12-Cup Coffee Maker. Featuring a programmable timer, you can set your brew time in advance for a hot pot ready when you need it. The clear glass carafe allows you to monitor coffee levels easily, while the drip-stop function lets you pour a cup mid-brew without mess. The easy-to-clean filter basket and compact design make BrewPro a kitchen essential for coffee lovers seeking convenience and consistency. Its reliable brewing technology extracts rich flavors, delivering a perfect cup every time.",
  "Brand": "BrewPro",
  "Price": 44.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 30,
  "Product": "MixMaster Stand Mixer 5Qt - Tilt-Head, 10 Speeds, Stainless Bowl",
  "Description": "5-quart tilt-head stand mixer with 10 speeds and stainless steel bowl.",
  "LongDescription": "The MixMaster 5Qt Stand Mixer is a versatile kitchen appliance built to handle all your mixing, whipping, and kneading needs. Its powerful motor offers 10 adjustable speeds, allowing you to control the mixing intensity for batters, doughs, and creams. The tilt-head design makes bowl access and attachment changes quick and easy. Crafted with a durable stainless steel bowl, it’s perfect for preparing large batches of baked goods. Included attachments make it a must-have tool for bakers and cooking enthusiasts who want consistent, hands-free mixing with professional results.",
  "Brand": "MixMaster",
  "Price": 149.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 31,
  "Product": "HeatWave Microwave Oven 1000W - Digital Display, Countertop",
  "Description": "1000W countertop microwave with digital display and 10 power levels.",
  "LongDescription": "Reheat, cook, and defrost quickly and evenly with the HeatWave 1000W Microwave Oven. Featuring a user-friendly digital display and 10 adjustable power levels, it offers precise control over cooking times and temperatures for a wide variety of dishes. Its spacious interior accommodates most plates and bowls, while the sleek countertop design fits neatly in any kitchen space. Additional features include a quick-start function and easy-to-clean interior surface. Whether preparing meals or snacks, HeatWave provides dependable performance and convenience in your daily cooking routine.",
  "Brand": "HeatWave",
  "Price": 119.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 32,
  "Product": "EdgeCraft Cutlery Set - 15-Piece, Stainless Steel, Wooden Block",
  "Description": "15-piece stainless steel cutlery set with wooden block.",
  "LongDescription": "Upgrade your kitchen with the EdgeCraft 15-Piece Cutlery Set, designed to provide all the essential knives and tools for meal preparation and dining. Made from high-quality stainless steel, each knife offers sharpness and durability to handle various cutting tasks with ease. The set includes chef’s, utility, paring, bread knives, and more, all housed neatly in a stylish wooden block that keeps your knives organized and safely stored. The ergonomic handles ensure comfortable grip and precise control. Perfect for both home cooks and culinary enthusiasts, EdgeCraft delivers quality, style, and function in one complete package.",
  "Brand": "EdgeCraft",
  "Price": 69.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 33,
  "Product": "PrepEase Measuring Set - 10-Piece Cups & Spoons, Engraved Markings",
  "Description": "10-piece measuring cups and spoons set with engraved measurements.",
  "LongDescription": "Achieve precise measurements every time with the PrepEase 10-Piece Measuring Set, perfect for both cooking and baking. This set includes a variety of measuring cups and spoons, each featuring clear, engraved markings that won’t fade or wear off. Crafted from durable, dishwasher-safe materials, these tools ensure accuracy and longevity. The nesting design allows for convenient storage, saving valuable kitchen space. Whether you're following a recipe or experimenting in the kitchen, PrepEase makes measuring ingredients quick, easy, and reliable.",
  "Brand": "PrepEase",
  "Price": 14.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 34,
  "Product": "DryNest Dish Drying Rack - 2-Tier, Utensil Holder, Draining Tray",
  "Description": "2-tier dish drying rack with utensil holder and draining tray.",
  "LongDescription": "Keep your kitchen organized and clutter-free with the DryNest 2-Tier Dish Drying Rack. Designed to maximize drying space, it features two spacious tiers capable of holding plates, bowls, and cookware, while the removable utensil holder keeps forks, knives, and spoons neatly arranged. The integrated draining tray directs excess water into your sink, preventing countertop messes. Made from rust-resistant materials, DryNest combines durability with practical design, making dishwashing and drying easier and more efficient for busy households.",
  "Brand": "DryNest",
  "Price": 34.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 35,
  "Product": "FlavorStack Spice Rack Organizer - Revolving, 16 Glass Jars",
  "Description": "Revolving spice rack with 16 glass jars (spices not included).",
  "LongDescription": "Organize and access your spices effortlessly with the FlavorStack Revolving Spice Rack. Featuring 16 clear glass jars with airtight lids, this compact organizer keeps your spices fresh and visible at all times. The revolving design allows quick access to any jar without cluttering your countertop. Its sturdy base ensures stability, and the sleek finish complements any kitchen décor. Spice jars are easy to fill and clean, making FlavorStack perfect for cooking enthusiasts who want a stylish and practical way to store their favorite seasonings.",
  "Brand": "FlavorStack",
  "Price": 29.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 36,
  "Product": "OvenReady Baking Set - 6-Piece, Non-Stick, Assorted Pans",
  "Description": "6-piece non-stick bakeware set including pans and trays.",
  "LongDescription": "Bake like a pro with the OvenReady 6-Piece Baking Set, featuring assorted pans designed for cakes, cookies, bread, and more. Each piece is coated with a premium non-stick surface to ensure easy release of baked goods and quick cleanup. Crafted from durable materials that provide even heat distribution, this set helps you achieve consistent baking results every time. The versatile assortment covers a variety of baking needs, making it perfect for beginners and experienced bakers alike. OvenReady combines convenience, performance, and style for your kitchen.",
  "Brand": "OvenReady",
  "Price": 49.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 37,
  "Product": "SharpEdge Knife Sharpener - 2-Stage Manual, Non-Slip Base",
  "Description": "2-stage manual knife sharpener with non-slip base.",
  "LongDescription": "Maintain the precision of your knives with the SharpEdge 2-Stage Manual Knife Sharpener. Designed for both coarse and fine sharpening, it restores blade sharpness quickly and safely. The non-slip base keeps the sharpener stable on your countertop for safe, controlled sharpening strokes. Its compact size makes it easy to store, while the ergonomic handle offers comfort and leverage during use. Suitable for most types of kitchen knives, SharpEdge ensures your blades stay razor-sharp for efficient and safe food preparation.",
  "Brand": "SharpEdge",
  "Price": 19.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 38,
  "Product": "CrushPro Garlic Press - Stainless Steel, Ergonomic Grip",
  "Description": "Heavy-duty stainless steel garlic press with ergonomic grip.",
  "LongDescription": "Make mincing garlic effortless with the CrushPro Garlic Press. Constructed from heavy-duty stainless steel, it resists rust and corrosion while providing excellent durability. The ergonomic grip reduces hand strain, allowing you to crush garlic cloves quickly and efficiently. Its simple design makes cleaning easy, and the press is dishwasher safe for added convenience. Whether you’re preparing sauces, marinades, or dressings, CrushPro helps you add fresh garlic flavor to your dishes with minimal effort.",
  "Brand": "CrushPro",
  "Price": 12.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 39,
  "Product": "SmoothBlend Immersion Blender - Variable Speed, Whisk Attachment",
  "Description": "Handheld immersion blender with variable speed control and whisk attachment.",
  "LongDescription": "The SmoothBlend Immersion Blender is a versatile tool designed to blend, puree, and whip directly in your pots, bowls, and pitchers. Its variable speed control lets you adjust blending power for delicate sauces or vigorous purees. Included attachments, like the whisk, expand functionality for whipping cream, beating eggs, and mixing batters. Lightweight and easy to handle, it simplifies meal preparation and cleanup. Perfect for soups, smoothies, and baking tasks, SmoothBlend brings professional blending capabilities to your home kitchen.",
  "Brand": "SmoothBlend",
  "Price": 39.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 40,
  "Product": "WeighWise Digital Kitchen Scale - Tare Function, LCD Display, 11lb Max",
  "Description": "Digital food scale with tare function and LCD display (max 11lb).",
  "LongDescription": "Achieve accurate measurements for your recipes with the WeighWise Digital Kitchen Scale. Featuring a clear LCD display and easy-to-use tare function, it allows you to subtract container weight for precise ingredient portions. With a capacity of up to 11 pounds (5 kilograms), it’s perfect for measuring everything from spices to large baking ingredients. Compact and lightweight, WeighWise is an essential tool for calorie counting, portion control, and perfect baking results. Its sleek design fits neatly in any kitchen drawer or countertop.",
  "Brand": "WeighWise",
  "Price": 18.99,
  "Category": "kitchen",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
  {
    "ID": 41,
    "Product": "UrbanEdge Men's Classic Fit Denim Jacket",
    "Description": "Durable and stylish denim jacket with a timeless cut and metal buttons.",
    "LongDescription": "This classic fit denim jacket by UrbanEdge offers a rugged, timeless look with reinforced seams and metal buttons. Its durable denim fabric makes it a staple for layering in any season. Whether worn casually or as part of a streetwear outfit, this jacket delivers lasting comfort and style.",
    "Brand": "UrbanEdge",
    "Price": 79.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 42,
    "Product": "ThreadSmith Women's Soft Knit Cardigan",
    "Description": "Lightweight and cozy knit cardigan perfect for layering in cool weather.",
    "LongDescription": "Wrap yourself in warmth with the ThreadSmith Soft Knit Cardigan. Designed for everyday comfort, it features a relaxed fit, ribbed cuffs and hem, and a breathable knit texture ideal for layering. Its soft-touch fabric ensures you'll stay cozy at home or out and about during cooler days.",
    "Brand": "ThreadSmith",
    "Price": 64.50,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 43,
    "Product": "Nordvue Men's Slim Fit Chinos - Khaki",
    "Description": "Modern slim fit chinos with stretch fabric for all-day comfort.",
    "LongDescription": "The Nordvue Slim Fit Chinos are designed to move with you. Crafted from a soft stretch cotton blend, these versatile khaki pants pair effortlessly with any top—from tees to button-downs—making them perfect for work, weekends, or casual nights out.",
    "Brand": "Nordvue",
    "Price": 54.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 44,
    "Product": "EvoWear Women's High-Rise Leggings - Black",
    "Description": "Moisture-wicking high-rise leggings designed for active and casual wear.",
    "LongDescription": "Designed to keep up with your lifestyle, the EvoWear High-Rise Leggings feature breathable, sweat-wicking fabric and a contouring fit. Perfect for the gym or lounging, they offer a flattering high-rise waistband that stays in place all day.",
    "Brand": "EvoWear",
    "Price": 39.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 45,
    "Product": "Modistry Unisex Oversized Hoodie - Charcoal",
    "Description": "Plush fleece hoodie with kangaroo pocket and adjustable drawstring.",
    "LongDescription": "The Modistry Oversized Hoodie delivers cozy comfort with modern edge. Made with premium fleece fabric, it includes an oversized hood, ribbed cuffs, and a front kangaroo pocket. Great for layering or lounging, this hoodie keeps you warm and stylish.",
    "Brand": "Modistry",
    "Price": 59.95,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 46,
    "Product": "UrbanEdge Men's Graphic Tee - Mountain Print",
    "Description": "100% cotton tee with vibrant mountain landscape graphic.",
    "LongDescription": "Bring adventure to your wardrobe with this UrbanEdge Graphic Tee. Made of ultra-soft cotton and featuring a scenic mountain print, this T-shirt pairs comfort with bold style. Ideal for layering or wearing solo during warmer days.",
    "Brand": "UrbanEdge",
    "Price": 24.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 47,
    "Product": "ThreadSmith Women's Button-Up Shirt - Linen Blend",
    "Description": "Breathable linen-blend shirt with a relaxed silhouette and rolled sleeves.",
    "LongDescription": "The ThreadSmith Linen Blend Shirt offers effortless style and comfort. Its breathable fabric, casual button-up design, and rolled sleeves make it a perfect go-to for spring and summer. Pairs beautifully with jeans or skirts.",
    "Brand": "ThreadSmith",
    "Price": 44.00,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 48,
    "Product": "Nordvue Men's Performance Polo - Navy",
    "Description": "Moisture-wicking polo shirt with classic collar and athletic cut.",
    "LongDescription": "Stay cool and comfortable with Nordvue's Performance Polo. Featuring moisture-wicking technology, a lightweight feel, and a tailored athletic fit, this polo transitions easily from work to weekend.",
    "Brand": "Nordvue",
    "Price": 35.00,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 49,
    "Product": "EvoWear Women's Cropped Active Tank - Heather Gray",
    "Description": "Breathable cropped tank with racerback design for workouts or layering.",
    "LongDescription": "This EvoWear Active Tank features breathable fabric, a stylish cropped cut, and a racerback design for full mobility. Whether you're working out or layering it for a casual look, it provides comfort and performance.",
    "Brand": "EvoWear",
    "Price": 28.50,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 50,
    "Product": "Modistry Men's Cargo Joggers - Olive",
    "Description": "Stretch cargo joggers with tapered legs and zippered pockets.",
    "LongDescription": "Modistry Cargo Joggers combine street style and utility with durable fabric, elastic waistband, and multiple zippered pockets. Perfect for casual days or active wear, these joggers bring functionality to fashion.",
    "Brand": "Modistry",
    "Price": 49.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 51,
    "Product": "UrbanEdge Women's Distressed Skinny Jeans",
    "Description": "Edgy skinny jeans with distressed details and faded wash.",
    "LongDescription": "UrbanEdge Skinny Jeans feature a flattering fit and edgy distressed details. With added stretch for comfort and a faded vintage wash, they're your go-to for casual looks with attitude.",
    "Brand": "UrbanEdge",
    "Price": 68.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 52,
    "Product": "ThreadSmith Men's Cotton Henley Shirt - Burgundy",
    "Description": "Casual 3-button Henley crafted from ultra-soft combed cotton.",
    "LongDescription": "Made for comfort and everyday wear, this ThreadSmith Henley Shirt offers a laid-back look with soft cotton fabric, a 3-button placket, and ribbed cuffs. Ideal for layering or wearing solo.",
    "Brand": "ThreadSmith",
    "Price": 31.75,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 53,
    "Product": "Nordvue Women's Longline Puffer Vest - Cream",
    "Description": "Lightweight puffer vest with snap closure and insulated lining.",
    "LongDescription": "Stay warm without bulk in the Nordvue Longline Puffer Vest. With sleek quilted insulation and a stylish snap front, it's perfect for layering on chilly days while keeping your silhouette modern.",
    "Brand": "Nordvue",
    "Price": 89.95,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 54,
    "Product": "EvoWear Men's Breathable Mesh Shorts - Black",
    "Description": "Quick-drying mesh shorts with elastic waistband and deep pockets.",
    "LongDescription": "EvoWear Mesh Shorts are built for performance and comfort. Made from breathable mesh with a flexible waistband and roomy pockets, they’re great for gym sessions, lounging, or warm-weather activities.",
    "Brand": "EvoWear",
    "Price": 29.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 55,
    "Product": "Modistry Women's Ribbed Knit Dress - Plum",
    "Description": "Stretchy ribbed dress with scoop neckline and midi length.",
    "LongDescription": "The Modistry Knit Dress offers a body-hugging fit with soft ribbed texture and elegant scoop neckline. The plum color adds depth and versatility, perfect for day-to-night transitions.",
    "Brand": "Modistry",
    "Price": 72.00,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 56,
    "Product": "UrbanEdge Men's Padded Flannel Shirt Jacket - Red Plaid",
    "Description": "Warm flannel shirt jacket with quilted lining and snap buttons.",
    "LongDescription": "Blending the best of a shirt and a jacket, this UrbanEdge flannel is padded for warmth with a quilted inner lining. Ideal for layering, it offers rustic charm with modern comfort and durability.",
    "Brand": "UrbanEdge",
    "Price": 84.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 57,
    "Product": "ThreadSmith Women's V-Neck Tee - Sky Blue",
    "Description": "Everyday essential tee with relaxed fit and breathable fabric.",
    "LongDescription": "This V-Neck Tee from ThreadSmith is soft, breathable, and flattering. With a relaxed silhouette and subtle drape, it's a must-have staple for any wardrobe and pairs effortlessly with jeans or skirts.",
    "Brand": "ThreadSmith",
    "Price": 22.00,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 58,
    "Product": "Nordvue Men's Wool Blend Overcoat - Charcoal",
    "Description": "Elegant wool blend overcoat with structured collar and deep pockets.",
    "LongDescription": "This Nordvue Overcoat combines classic tailoring with warmth and elegance. The wool-blend fabric, sharp lapels, and deep side pockets make it a winter essential for polished and professional outfits.",
    "Brand": "Nordvue",
    "Price": 129.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 59,
    "Product": "EvoWear Women's Seamless sport Bra - Lavender",
    "Description": "Supportive seamless bra with removable pads and moisture control.",
    "LongDescription": "EvoWear's Seamless sport Bra is designed to provide all-day support and comfort. Featuring soft stretch fabric, removable padding, and breathable construction, it's ideal for light workouts or casual wear.",
    "Brand": "EvoWear",
    "Price": 34.99,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 60,
    "Product": "Modistry Men's Relaxed Fit Lounge Pants - Navy",
    "Description": "Soft jersey knit lounge pants with drawstring waist and tapered leg.",
    "LongDescription": "Experience relaxation in the Modistry Lounge Pants. With ultra-soft jersey fabric, adjustable drawstring, and a modern tapered fit, these pants are ideal for unwinding at home or casual weekend wear.",
    "Brand": "Modistry",
    "Price": 42.50,
    "Category": "cloth",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
    {
    "ID": 61,
    "Product": "VortexX Pro Grip All-Weather Football - Official Size",
    "Description": "High-grip synthetic leather football for all-weather play.",
    "LongDescription": "The VortexX Pro Grip Football is built for serious players. Featuring a weather-resistant synthetic leather surface and reinforced double-stitched seams, it provides optimal grip and durability for gameplay in any condition—rain or shine. Designed to match official size and weight specifications, it’s perfect for both training and competitive matches.",
    "Brand": "IronClad sport",
    "Price": 39.99,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 62,
    "Product": "StrikerX Portable Soccer Goal Set - Quick Setup with Carry Bag",
    "Description": "Lightweight and portable soccer goal with carry bag.",
    "LongDescription": "The StrikerX Portable Soccer Goal Set is the perfect training companion for players of all levels. It features a pop-up fiberglass frame for quick setup and takedown, and includes a weather-resistant carry bag for easy transport. Ideal for backyards, parks, or practice fields, it helps improve shooting accuracy and game play.",
    "Brand": "GoalForge",
    "Price": 59.99,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 63,
    "Product": "CoreStrike Elite Weightlifting Gloves with Wrist Support",
    "Description": "Padded weightlifting gloves with wrist support.",
    "LongDescription": "Take your gym sessions to the next level with CoreStrike Elite Weightlifting Gloves. Designed with reinforced palm padding, breathable mesh for ventilation, and adjustable velcro wrist straps, these gloves provide comfort, control, and safety during even your heaviest lifts. Ideal for strength training, CrossFit, and calisthenics.",
    "Brand": "TitanCore",
    "Price": 24.50,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 64,
    "Product": "GlideNet Performance Graphite Tennis Racket - Vibration Dampening",
    "Description": "Graphite tennis racket with vibration dampening grip.",
    "LongDescription": "The GlideNet Performance Tennis Racket is crafted with premium graphite for a perfect balance of control and power. It features a vibration-dampening grip for reduced strain on wrists and elbows, making it ideal for long matches. The aerodynamic frame allows for quicker swings and enhanced shot precision.",
    "Brand": "NetBlaze",
    "Price": 99.00,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 65,
    "Product": "PowerLane Anti-Fog UV Swim Goggles - Adjustable Fit",
    "Description": "Anti-fog and UV-protective swim goggles.",
    "LongDescription": "The PowerLane Swim Goggles provide superior clarity and comfort for competitive and recreational swimmers. With UV protection, anti-fog coating, and a leak-proof silicone seal, they’re built for durability and a secure fit. The adjustable strap and nose bridge adapt to any face shape for a comfortable swim every time.",
    "Brand": "AquaVibe",
    "Price": 18.25,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 66,
    "Product": "ZenFlex Eco Yoga Mat - 6mm Non-Slip Cushion Support",
    "Description": "Eco-friendly yoga mat with extra cushioning.",
    "LongDescription": "The ZenFlex Eco Yoga Mat provides a soft yet supportive 6mm cushion for ultimate comfort and joint protection. Made from eco-conscious materials, it features a textured, non-slip surface that keeps you grounded in every pose. Ideal for yoga, Pilates, and stretching sessions.",
    "Brand": "FlowTribe",
    "Price": 34.95,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 67,
    "Product": "UltraSpin Pro Table Tennis Paddle - Carbon Fiber Core",
    "Description": "Advanced table tennis paddle with carbon fiber layer.",
    "LongDescription": "Dominate your matches with the UltraSpin Pro Table Tennis Paddle. Engineered with a carbon fiber core and high-tack rubber surface, it delivers explosive spin and control. Its ergonomic grip and balanced weight make it ideal for intermediate to advanced players.",
    "Brand": "PingRival",
    "Price": 45.00,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 68,
    "Product": "EnduroMax Adjustable Resistance Bands Set with Handles",
    "Description": "Full-body resistance band set with carrying pouch.",
    "LongDescription": "The EnduroMax Resistance Bands Set includes five color-coded bands with varying resistance levels, soft-grip handles, ankle straps, and a door anchor for full-body workouts anywhere. The set comes with a travel-friendly carry pouch and is perfect for strength, flexibility, and rehabilitation exercises.",
    "Brand": "CoreMotion",
    "Price": 29.95,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 69,
    "Product": "SureGrip Pro Batting Gloves - Extra Padding & Ventilation",
    "Description": "Durable batting gloves with padded palm and mesh top.",
    "LongDescription": "The SureGrip Pro Batting Gloves are built for hitters who demand comfort and durability. With impact-absorbing padded palms and a ventilated mesh back, they provide excellent grip and breathability. The adjustable wrist strap ensures a custom, secure fit every time.",
    "Brand": "SluggerLine",
    "Price": 27.75,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 70,
    "Product": "CrossTrail 2L Hydration Backpack - Lightweight with Bladder",
    "Description": "Compact hydration backpack with 2L BPA-free bladder.",
    "LongDescription": "The CrossTrail Hydration Pack keeps you hydrated on hikes, bike rides, or long runs. It includes a 2-liter BPA-free water bladder, easy-access hose, and breathable mesh straps. Multiple zippered compartments provide space for snacks, tools, or keys during outdoor adventures.",
    "Brand": "TrailRush",
    "Price": 42.60,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 71,
    "Product": "RallyGrip Indoor Pickleball Paddle - Fiberglass Face",
    "Description": "Lightweight pickleball paddle with honeycomb core.",
    "LongDescription": "Engineered for precision, the RallyGrip Indoor Pickleball Paddle features a fiberglass surface and a durable honeycomb polymer core. Lightweight and responsive, it's designed for fast rallies and accurate shots. The comfort grip helps reduce hand fatigue for extended gameplay.",
    "Brand": "SpinArc",
    "Price": 49.95,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 72,
    "Product": "XCore Agility Cone Set - 20 Cones with Carrying Bag",
    "Description": "Multi-colored cones for speed and agility drills.",
    "LongDescription": "Enhance your training sessions with the XCore Agility Cone Set. Includes 20 bright, flexible cones in four colors and a mesh storage bag. Ideal for soccer, football, basketball, or general fitness drills to improve agility, coordination, and speed.",
    "Brand": "SprintMark",
    "Price": 21.30,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 73,
    "Product": "SkyEdge Aluminum Baseball Bat - 30-Inch Lightweight Design",
    "Description": "Balanced aluminum bat for practice and recreational play.",
    "LongDescription": "The SkyEdge Aluminum Bat offers a perfect balance of power and speed. Constructed from lightweight, durable aluminum alloy, it's suitable for youth and adult recreational players. The ergonomic grip enhances control, while the 30-inch size is ideal for practice and training.",
    "Brand": "Skyline sport",
    "Price": 38.40,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 74,
    "Product": "PeakForm Knee Support Sleeve - Compression Fit with Stabilizers",
    "Description": "Supportive compression knee sleeve with side stabilizers.",
    "LongDescription": "The PeakForm Knee Support Sleeve is crafted to relieve pressure and provide joint stability. With dual side stabilizers, breathable compression fabric, and a non-slip interior lining, it’s perfect for running, lifting, or injury recovery. Offers firm support without restricting movement.",
    "Brand": "OrthoFlex",
    "Price": 22.50,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 75,
    "Product": "SpinTrek Training Jump Rope - Adjustable Speed Cable",
    "Description": "Adjustable speed rope with steel cable and grip handles.",
    "LongDescription": "Improve your cardio and coordination with the SpinTrek Speed Jump Rope. It features a tangle-free steel cable, ball-bearing handles for smooth rotation, and adjustable length for a customized workout. Great for boxing, HIIT, and endurance training.",
    "Brand": "CardioX",
    "Price": 16.85,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 76,
    "Product": "TrailClaw Hiking Poles - Adjustable Carbon with Shock Absorption",
    "Description": "Carbon hiking poles with anti-shock system and cork grip.",
    "LongDescription": "Conquer rugged terrain with TrailClaw Carbon Hiking Poles. Featuring shock-absorbing tips, ergonomic cork grips, and adjustable height, they reduce stress on knees and improve stability. Includes interchangeable tips and a travel pouch for portability.",
    "Brand": "PeakStride",
    "Price": 64.99,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 77,
    "Product": "AeroBlast Badminton Set - 2 Rackets, 3 Shuttlecocks, Carry Bag",
    "Description": "Complete badminton set with rackets, shuttles, and bag.",
    "LongDescription": "Get ready for backyard fun with the AeroBlast Badminton Set. Includes two lightweight rackets, three nylon shuttlecocks, and a zippered carrying bag. Perfect for recreational players looking for quick and easy outdoor entertainment.",
    "Brand": "AirFlight",
    "Price": 33.99,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 78,
    "Product": "ProStep Balance Trainer Board - Core & Stability Training",
    "Description": "Anti-slip balance board for core strength and rehab.",
    "LongDescription": "The ProStep Balance Trainer is a must-have for improving core strength, balance, and coordination. With its non-slip surface and durable ABS base, it's ideal for home workouts, physiotherapy, or athletic training. Supports up to 300 lbs.",
    "Brand": "BalanceForge",
    "Price": 31.80,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 79,
    "Product": "StrikeVision Boxing Hand Wraps - Breathable Elastic Blend (180-Inch)",
    "Description": "Boxing hand wraps with thumb loop and velcro closure.",
    "LongDescription": "Protect your wrists and knuckles with StrikeVision Boxing Hand Wraps. These 180-inch wraps are made from a stretchy, breathable blend and feature a thumb loop and strong hook-and-loop closure. Suitable for boxing, MMA, and Muay Thai training.",
    "Brand": "KnockOut Gear",
    "Price": 12.45,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
  {
    "ID": 80,
    "Product": "Velocity Sprint Parachute - Adjustable Belt & Carry Pouch",
    "Description": "Speed training parachute for resistance workouts.",
    "LongDescription": "The Velocity Sprint Parachute adds dynamic resistance to sprint drills, improving acceleration and explosive power. It features an adjustable waist belt and quick-release buckle for training versatility. Folds into a compact carry pouch for on-the-go workouts.",
    "Brand": "SpeedForge",
    "Price": 28.90,
    "Category": "sport",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
    {
    "ID": 100,
    "Product": "EchoNova Wireless Headphones - ANC, Over-Ear, 40H Battery",
    "Description": "Premium over-ear wireless headphones with 40-hour battery life and active noise cancelling.",
    "LongDescription": "Take your listening to the next level with EchoNova Wireless Headphones. Featuring adaptive active noise cancelling (ANC), deep bass response, and ultra-clear treble, these headphones are ideal for audiophiles and everyday users alike. Designed with memory foam ear cushions and an ergonomic headband, they offer lasting comfort through extended use. With 40 hours of battery life and USB-C fast charging, you can enjoy uninterrupted music or calls wherever you go. EchoNova’s Bluetooth 5.1 ensures a seamless connection with smartphones, tablets, and laptops. Built-in smart controls and voice assistant compatibility make operation effortless. Foldable and lightweight, they’re perfect for on-the-go lifestyles.",
    "Brand": "EchoNova",
    "Price": 109.99,
    "Category": "electronic",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  },
{
  "ID": 101,
  "Product": "Auralux Wired In-Ear Headphones - Clear Sound, Comfortable Fit",
  "Description": "Simple wired in-ear headphones offering clear sound and comfortable wear.",
  "LongDescription": "The Auralux Wired In-Ear Headphones deliver reliable audio performance with a comfortable, lightweight design. Perfect for everyday listening, these headphones feature soft silicone ear tips for a secure fit and clear sound quality. With a standard 3.5mm jack, they are compatible with most smartphones, tablets, and laptops. Ideal for calls, music, and podcasts on the go.",
  "Brand": "Auralux",
  "Price": 29.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},
{
  "ID": 102,
  "Product": "SonicWave AeroLite In-Ear Wireless Earbuds - Compact, 26H Battery, Mic",
  "Description": "Lightweight in-ear wireless earbuds with 26-hour battery life and crystal-clear sound.",
  "LongDescription": "Experience high-quality audio in a compact form with the SonicWave AeroLite In-Ear Wireless Earbuds. These true wireless earbuds deliver balanced sound with crisp highs and deep bass, ideal for both casual listening and calls. Featuring up to 6 hours of playback on a single charge and an additional 20 hours with the sleek, pocket-sized charging case. Built-in microphone and touch controls allow easy call handling, music navigation, and voice assistant activation. The earbuds are IPX4 rated for sweat resistance, making them perfect for commuting, workouts, or daily use. Bluetooth 5.0 ensures a stable and fast connection to your device.",
  "Brand": "SonicWave",
  "Price": 79.99,
  "Category": "electronic",
  "SellerID": 1,
  "SellerUsername": "tiagooc10"
},  {
    "ID": 103,
    "Product": "NeonBeat Flex ANC Headphones - Foldable, Wireless, 28H Battery",
    "Description": "Lightweight wireless headphones with ANC, foldable design, and 28-hour battery.",
    "LongDescription": "Designed for portability and power, the NeonBeat Flex headphones offer an unbeatable combination of style and function. With Active Noise Cancelling and powerful 40mm drivers, you’ll experience immersive audio whether on a plane or at the gym. The lightweight, foldable design makes them travel-ready, while the soft-touch ear cups provide lasting comfort. Enjoy up to 28 hours of wireless playback with USB-C quick charge. NeonBeat Flex supports multipoint Bluetooth pairing and includes on-ear controls for effortless navigation.",
    "Brand": "NeonBeat",
    "Price": 84.50,
    "Category": "electronic",
    "SellerID": 1,
    "SellerUsername": "tiagooc10"
  }
]

